## Pandas Essentials

In [100]:
import pandas as pd
import numpy as np

# Create a random flights data CSV file
# np.random.seed(0)
num_records = 100

AIRLINES = [
    "PIA",
    "Qatar Airways",
    "Emirates",
    "Japan Airways",
    "American Airline",
    "Tata Airline",
    "Saudi Airline",
]

CITIES = [
    "Dubai",
    "Delhi",
    "Karachi",
    "Riyadh",
    "Mecca",
    "Medina",
    "Kuwait",
    "Lahore",
    "Colombo",
    "Dhaka",
    "Sharjah",
    "Mumbai",
    "Auckland",
    "Alaska",
    "San Francisco",
    "Washington",
]

## Creating a random DataFrame

In [101]:
flights_data = {
    "FlightID": np.arange(1, num_records + 1),
    "Airline": np.random.choice(AIRLINES, num_records),
    "Destination": np.random.choice(CITIES, num_records),
    "Duration": np.random.randint(60, 360, num_records),  # Duration in minutes
    "Delay": np.random.randint(0, 120, num_records),  # Delay in minutes
}

df = pd.DataFrame(flights_data)
df.to_csv("random_flights_data.csv", index=False)

In [102]:
# Read the CSV file using pandas
df = pd.read_csv("random_flights_data.csv")

In [103]:
# Returns the first five rows of the dataframe
df.head()

# Pass a number as parameter to get that many rows from the top
# `df.head(10)` will return 10 rows

   FlightID           Airline Destination  Duration  Delay
0         1     Qatar Airways     Karachi        69     27
1         2     Japan Airways     Karachi       236     13
2         3          Emirates       Mecca        63     93
3         4  American Airline       Dubai       220     21
4         5               PIA       Dhaka       315    102

In [104]:
# Similar to head(), tail() returns the last five rows of the dataframe
df.tail()

    FlightID        Airline    Destination  Duration  Delay
95        96   Tata Airline          Delhi       290     38
96        97   Tata Airline          Delhi       264     47
97        98   Tata Airline  San Francisco       135     63
98        99  Saudi Airline          Dubai       176     80
99       100  Saudi Airline         Riyadh       217     96

In [105]:
# Similar to head(), tail() returns the last five rows of the dataframe
df.tail()

    FlightID        Airline    Destination  Duration  Delay
95        96   Tata Airline          Delhi       290     38
96        97   Tata Airline          Delhi       264     47
97        98   Tata Airline  San Francisco       135     63
98        99  Saudi Airline          Dubai       176     80
99       100  Saudi Airline         Riyadh       217     96

## Perform operations on the data

In [117]:

# Example: Calculate the average duration and delay for each airline
average_stats = df.groupby("Airline")[["Duration", "Delay"]].mean()
display(average_stats)

display(f"Max Delay: {average_stats['Delay'].max()} minutes")
display(f"Max Duration: {average_stats['Duration'].max()} minutes")

                    Duration      Delay
Airline
American Airline  195.571429  56.928571
Emirates          202.800000  70.800000
Japan Airways     213.200000  59.733333
PIA               234.437500  56.375000
Qatar Airways     214.750000  51.250000
Saudi Airline     203.285714  60.285714
Tata Airline      212.631579  69.473684

'Max Delay: 70.8 minutes'

'Max Duration: 234.4375 minutes'

In [107]:
max_delay_airline = average_stats["Delay"].idxmax()
max_duration_airline = average_stats["Duration"].idxmax()

display(f"Airline with the maximum average delay: {max_delay_airline}")
display(f"Airline with the maximum average duration: {max_duration_airline}")

'Airline with the maximum average delay: Emirates'

'Airline with the maximum average duration: PIA'

In [108]:
df.info(verbose=False) # Provides a concise summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Columns: 5 entries, FlightID to Delay
dtypes: int64(3), object(2)
memory usage: 4.0+ KB

In [109]:
display(f"Columns: {df.columns}")
display(f"Keys: {df.keys()}")
display(f"Index: {df.index}")
display(f"Values: {df.values}")
display(f"Shape: {df.shape}")
display(f"Length: {len(df)}")
display(f"Size: {df.size}")
display(f"Data types: {df.dtypes}")
display(f"Memory usage: {df.memory_usage()}")

"Columns: Index(['FlightID', 'Airline', 'Destination', 'Duration', 'Delay'], dtype='object')"

"Keys: Index(['FlightID', 'Airline', 'Destination', 'Duration', 'Delay'], dtype='object')"

'Index: RangeIndex(start=0, stop=100, step=1)'

"Values: [[1 'Qatar Airways' 'Karachi' 69 27]\n [2 'Japan Airways' 'Karachi' 236 13]\n [3 'Emirates' 'Mecca' 63 93]\n [4 'American Airline' 'Dubai' 220 21]\n [5 'PIA' 'Dhaka' 315 102]\n [6 'Emirates' 'Sharjah' 76 57]\n [7 'Japan Airways' 'San Francisco' 66 113]\n [8 'Qatar Airways' 'Sharjah' 168 53]\n [9 'Emirates' 'Sharjah' 347 113]\n [10 'Saudi Airline' 'Sharjah' 332 31]\n [11 'Japan Airways' 'Alaska' 320 27]\n [12 'Tata Airline' 'Sharjah' 173 97]\n [13 'PIA' 'Dubai' 271 71]\n [14 'Qatar Airways' 'Dhaka' 136 80]\n [15 'Saudi Airline' 'Delhi' 227 69]\n [16 'Japan Airways' 'Sharjah' 350 52]\n [17 'PIA' 'Medina' 290 81]\n [18 'PIA' 'Dhaka' 126 7]\n [19 'Saudi Airline' 'San Francisco' 197 35]\n [20 'Saudi Airline' 'Karachi' 68 27]\n [21 'Japan Airways' 'Medina' 225 76]\n [22 'Emirates' 'Washington' 148 36]\n [23 'Tata Airline' 'Delhi' 131 38]\n [24 'Emirates' 'Lahore' 144 113]\n [25 'PIA' 'Lahore' 180 65]\n [26 'American Airline' 'San Francisco' 331 32]\n [27 'PIA' 'Auckland' 221 19]\n [28 'Tata Airline' 'Mumbai' 197 42]\n [29 'PIA' 'Riyadh' 282 86]\n [30 'PIA' 'Mecca' 105 43]\n [31 'Qatar Airways' 'Alaska' 341 3]\n [32 'Japan Airways' 'Dubai' 311 98]\n [33 'PIA' 'Karachi' 294 78]\n [34 'American Airline' 'Riyadh' 162 104]\n [35 'Tata Airline' 'Kuwait' 335 83]\n [36 'Saudi Airline' 'Auckland' 187 62]\n [37 'PIA' 'Washington' 347 49]\n [38 'Tata Airline' 'Mumbai' 167 109]\n [39 'Japan Airways' 'Medina' 91 63]\n [40 'American Airline' 'Riyadh' 169 70]\n [41 'American Airline' 'Colombo' 123 102]\n [42 'Tata Airline' 'Karachi' 132 29]\n [43 'Japan Airways' 'Colombo' 278 88]\n [44 'Tata Airline' 'Sharjah' 221 115]\n [45 'PIA' 'Mumbai' 154 47]\n [46 'American Airline' 'Kuwait' 163 58]\n [47 'American Airline' 'Kuwait' 206 30]\n [48 'Tata Airline' 'Dubai' 229 18]\n [49 'American Airline' 'Kuwait' 82 55]\n [50 'Japan Airways' 'Colombo' 108 75]\n [51 'Emirates' 'Riyadh' 316 60]\n [52 'Emirates' 'Karachi' 288 84]\n [53 'American Airline' 'Dubai' 341 73]\n [54 'PIA' 'Washington' 337 29]\n [55 'Japan Airways' 'Washington' 221 27]\n [56 'Saudi Airline' 'Dubai' 172 89]\n [57 'Saudi Airline' 'Medina' 119 107]\n [58 'Saudi Airline' 'Lahore' 217 80]\n [59 'Japan Airways' 'Dhaka' 278 111]\n [60 'Qatar Airways' 'Washington' 178 58]\n [61 'Tata Airline' 'Dubai' 294 22]\n [62 'Qatar Airways' 'Delhi' 212 57]\n [63 'Tata Airline' 'Mumbai' 103 80]\n [64 'PIA' 'Mecca' 325 83]\n [65 'Tata Airline' 'Colombo' 159 102]\n [66 'Saudi Airline' 'Auckland' 129 91]\n [67 'PIA' 'Karachi' 154 10]\n [68 'Qatar Airways' 'Lahore' 352 107]\n [69 'Qatar Airways' 'Karachi' 339 78]\n [70 'Emirates' 'Kuwait' 104 46]\n [71 'American Airline' 'Delhi' 171 69]\n [72 'Saudi Airline' 'Auckland' 297 16]\n [73 'Saudi Airline' 'Washington' 258 24]\n [74 'PIA' 'Alaska' 245 18]\n [75 'American Airline' 'Kuwait' 149 30]\n [76 'Tata Airline' 'Medina' 227 109]\n [77 'Qatar Airways' 'Kuwait' 180 9]\n [78 'Japan Airways' 'Alaska' 236 69]\n [79 'Tata Airline' 'Delhi' 219 96]\n [80 'American Airline' 'Alaska' 194 116]\n [81 'Emirates' 'San Francisco' 295 57]\n [82 'American Airline' 'Delhi' 284 30]\n [83 'Tata Airline' 'Lahore' 138 28]\n [84 'Japan Airways' 'Sharjah' 118 46]\n [85 'Qatar Airways' 'Lahore' 252 64]\n [86 'PIA' 'Riyadh' 105 114]\n [87 'Qatar Airways' 'Medina' 131 6]\n [88 'Japan Airways' 'Delhi' 207 15]\n [89 'Japan Airways' 'Lahore' 153 23]\n [90 'Tata Airline' 'Karachi' 345 107]\n [91 'American Airline' 'Karachi' 143 7]\n [92 'Qatar Airways' 'Mecca' 219 73]\n [93 'Tata Airline' 'Karachi' 281 97]\n [94 'Saudi Airline' 'Colombo' 250 37]\n [95 'Emirates' 'San Francisco' 247 49]\n [96 'Tata Airline' 'Delhi' 290 38]\n [97 'Tata Airline' 'Delhi' 264 47]\n [98 'Tata Airline' 'San Francisco' 135 63]\n [99 'Saudi Airline' 'Dubai' 176 80]\n [100 'Saudi Airline' 'Riyadh' 217 96]]"

'Shape: (100, 5)'

'Length: 100'

'Size: 500'

'Data types: FlightID        int64\nAirline        object\nDestination    object\nDuration        int64\nDelay           int64\ndtype: object'

'Memory usage: Index          132\nFlightID       800\nAirline        800\nDestination    800\nDuration       800\nDelay          800\ndtype: int64'

In [110]:
df.describe() # Generates descriptive statistics of the dataframe

         FlightID    Duration       Delay
count  100.000000  100.000000  100.000000
mean    50.500000  211.780000   60.820000
std     29.011492   81.818545   32.638943
min      1.000000   63.000000    3.000000
25%     25.750000  147.000000   30.000000
50%     50.500000  214.500000   61.000000
75%     75.250000  282.500000   86.500000
max    100.000000  352.000000  116.000000

In [111]:
display(df['Airline'].value_counts()) # Returns the count of unique values in the 'Airline' column
print(f"Display max value in each column: {df[['Airline','Destination','Delay','Duration']]}") # Returns the maximum value in each column

Airline
Tata Airline        19
PIA                 16
Japan Airways       15
American Airline    14
Saudi Airline       14
Qatar Airways       12
Emirates            10
Name: count, dtype: int64

Display max value in each column:              Airline    Destination  Delay  Duration
0      Qatar Airways        Karachi     27        69
1      Japan Airways        Karachi     13       236
2           Emirates          Mecca     93        63
3   American Airline          Dubai     21       220
4                PIA          Dhaka    102       315
..               ...            ...    ...       ...
95      Tata Airline          Delhi     38       290
96      Tata Airline          Delhi     47       264
97      Tata Airline  San Francisco     63       135
98     Saudi Airline          Dubai     80       176
99     Saudi Airline         Riyadh     96       217

[100 rows x 4 columns]

### Conditional selection

In [112]:
df[df['Duration'] < 90] #Performing list comprehension on the dataframe

    FlightID           Airline    Destination  Duration  Delay
0          1     Qatar Airways        Karachi        69     27
2          3          Emirates          Mecca        63     93
5          6          Emirates        Sharjah        76     57
6          7     Japan Airways  San Francisco        66    113
19        20     Saudi Airline        Karachi        68     27
48        49  American Airline         Kuwait        82     55

In [113]:
# Selecting columns based on data types
df.select_dtypes('int') # Selects columns with numeric data types

    FlightID  Duration  Delay
0          1        69     27
1          2       236     13
2          3        63     93
3          4       220     21
4          5       315    102
..       ...       ...    ...
95        96       290     38
96        97       264     47
97        98       135     63
98        99       176     80
99       100       217     96

[100 rows x 3 columns]

## Filtering rows

The `loc` and the `iloc` method

In [114]:

df.iloc[1,3], df.loc[1,'Duration']

(236, 236)

In [115]:
df.loc[
    2:6, "Airline":"Duration"
]  # Selects rows 2 to 6 and columns 'Airline' to 'Duration'

            Airline    Destination  Duration
2          Emirates          Mecca        63
3  American Airline          Dubai       220
4               PIA          Dhaka       315
5          Emirates        Sharjah        76
6     Japan Airways  San Francisco        66

In [116]:
df.iloc[0:5, 2:5] # Selecting a subset of the dataframe

  Destination  Duration  Delay
0     Karachi        69     27
1     Karachi       236     13
2       Mecca        63     93
3       Dubai       220     21
4       Dhaka       315    102